#include<stdio.h>
//公鸡1只价格为5钱，母鸡1只价格为3钱，小鸡3只价格为1钱，用100钱能买多少只公鸡和母鸡和小鸡？ 

	int main()
	{
		int x,y,z; //x为公鸡，y为母鸡,z为小鸡 
		
		for(x=0; x<=100; x++)	//循环前令x=0,当x<=100时进行循环，每轮循环结束，x的值加一 
			{
				for(y=0; y<=100; y++) //同理 
					{
						for(z=0 ;z<=100; z++)//同理 
							{
								if(z%3==0 && x+y+z==100  && x*5+y*3+z/3==100)	//条件判断，x+y+z表三只鸡总数，x*5+y*3+z/3表购买三只鸡的价格总数，如果都为100则正确 
									printf("公鸡：%d,母鸡：%d,小鸡:%d\n",x,y,z);	//输出三个数的值																	
							}
					}
			}
		
		return 0;
	} 
